In [1]:
import pandas as pd
import numpy as np

In [2]:
# prep data
nb_datapoints = 100

np.random.seed(42)
df = pd.DataFrame(np.random.randint(2, size=(nb_datapoints,4)), columns=['a', 'b', 'c', 'd'])

In [3]:
# put values from cells to list
cols_to_list = ['b', 'c', 'd']
df['list'] = df[cols_to_list].values.tolist()

In [4]:
df.head()

   a  b  c  d       list
0  0  1  0  0  [1, 0, 0]
1  0  1  0  0  [1, 0, 0]
2  0  1  0  0  [1, 0, 0]
3  0  0  1  0  [0, 1, 0]
4  1  1  1  0  [1, 1, 0]

In [5]:
# concatenate these lists into one
np.concatenate(df['list'])

array([1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0,
       1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1,
       1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1,
       1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0])

In [6]:
# extract columns
new_col_names = ['b*', 'c*', 'd*']
new_df = pd.DataFrame(df['list'].values.tolist(), columns=new_col_names)

# can join or concatenate with the original column if needed

new_df.head()

   b*  c*  d*
0   1   0   0
1   1   0   0
2   1   0   0
3   0   1   0
4   1   1   0